Reports/ВедомостьАмортизацииОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ВедомостьАмортизацииОС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетСписокКроссТаблица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/СтоимостьОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>СтоимостьОС</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Comment>В валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Амортизация</Name>
					<Comment>В валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ПервоначальныеСведенияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияОС</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыВыработкиОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостоянияОС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Comment>Дата состояния</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Comment>Основное средство</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестонахождениеОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>МестонахождениеОС</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Выбирается из списка регистра сведений Работники</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СостоянияОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВведеноВЭксплуатацию</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСУчета</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ВедомостьАмортизацииОС/Ext/ObjectModule.bsl
#Если Клиент Тогда
// Настройка периода
Перем НП Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	// не выводим общие
	ОбщийОтчет.мСтруктураНевыводимыхГруппировок.Вставить("Общие", 1);

	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "ДатаНач"              , ОбщийОтчет.ДатаНач);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "ДатаКон"              , КонецДня(ОбщийОтчет.ДатаКон));
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СостояниеВвода"       , Перечисления.СостоянияОС.ВведеноВЭксплуатацию);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СостояниеСнятияСУчета", Перечисления.СостоянияОС.СнятоСУчета);
	
	ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке = Истина;
	
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры // СформироватьОтчет()

// Процедура - заполняет начальные настройки отчета
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	
	Текст = 
	"ВЫБРАТЬ
	|	РегАмортизация.ОсновноеСредство                            КАК ОсновноеСредство,
	|	ПРЕДСТАВЛЕНИЕ(РегАмортизация.ОсновноеСредство)             КАК ОсновноеСредствоПредставление,
	|	РегСведенияОбОС.СпособНачисленияАмортизации                КАК СпособНачисления,
	|	ПРЕДСТАВЛЕНИЕ(РегСведенияОбОС.СпособНачисленияАмортизации) КАК СпособНачисленияПредставление,
	|	СУММА(РегАмортизация.СтоимостьНачальныйОстаток)            КАК СтоимостьНачальныйОстаток,
	|	СУММА(РегАмортизация.СтоимостьКонечныйОстаток)             КАК СтоимостьКонечныйОстаток,
	|	СУММА(РегАмортизация.СтоимостьОборот)                      КАК СтоимостьОборот,
	|	СУММА(РегАмортизация.АмортизацияНачальныйОстаток)          КАК АмортизацияНачальныйОстаток,
	|	СУММА(РегАмортизация.АмортизацияКонечныйОстаток)           КАК АмортизацияКонечныйОстаток,
	|	СУММА(РегАмортизация.АмортизацияОборот)                    КАК АмортизацияОборот,
	|	СУММА(РегАмортизация.СтоимостьКонечныйОстаток) 
	|		- СУММА(РегАмортизация.АмортизацияКонечныйОстаток)     КАК ОстаточнаяСтоимость,
	|	СУММА(РегСведенияОбОС.ПервоначальнаяСтоимость)             КАК ПервоначальнаяСтоимость,
	|	РегСостояниеОС.ДатаВводаВЭксплуатацию                      КАК ДатаВводаВЭксплуатацию,
	|	РегСостояниеОС.ДатаСнятияСУчета                            КАК ДатаСнятияСУчета,
	|	МестонахождениеОС.МОЛ                                      КАК МОЛ,
	|	ПРЕДСТАВЛЕНИЕ(МестонахождениеОС.МОЛ)                       КАК МОЛПредставление,
	|	МестонахождениеОС.Местонахождение                          КАК Местонахождение,
	|	ПРЕДСТАВЛЕНИЕ(МестонахождениеОС.Местонахождение)           КАК МестонахождениеПредставление
	|{ВЫБРАТЬ
	|	РегАмортизация.ОсновноеСредство.*           КАК ОсновноеСредство,
	|	РегСведенияОбОС.СпособНачисленияАмортизации КАК СпособНачисления,
	|	ДатаВводаВЭксплуатацию                      КАК ДатаВводаВЭксплуатацию,
	|	ДатаСнятияСУчета                            КАК ДатаСнятияСУчета,
	|	МОЛ,
	|	Местонахождение}
	|ИЗ
	|	РегистрНакопления.СтоимостьОС.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , ,
	|	                  {ОсновноеСредство.* КАК ОсновноеСредство}) КАК РегАмортизация
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ПервоначальныеСведенияОС.СрезПоследних(&ДатаКон,
	|			                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК РегСведенияОбОС
	|		ПО РегАмортизация.ОсновноеСредство = РегСведенияОбОС.ОсновноеСредство}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			(ВЫБРАТЬ
	|				СостоянияОС.ОсновноеСредство КАК ОсновноеСредство,
	|				МАКСИМУМ(ВЫБОР
	|						 	КОГДА СостоянияОС.Состояние = &СостояниеВвода
	|								ТОГДА СостоянияОС.ДатаСостояния
	|						 	ИНАЧЕ NULL
	|					     КОНЕЦ) КАК ДатаВводаВЭксплуатацию,
	|				МАКСИМУМ(ВЫБОР
	|						 	КОГДА СостоянияОС.Состояние = &СостояниеСнятияСУчета
	|								ТОГДА СостоянияОС.ДатаСостояния
	|						    ИНАЧЕ NULL
	|					     КОНЕЦ) КАК ДатаСнятияСУчета
	|			ИЗ
	|				РегистрСведений.СостоянияОС КАК СостоянияОС
	|			{ГДЕ
	|				СостоянияОС.ОсновноеСредство.*}
	|		
	|			СГРУППИРОВАТЬ ПО
	|				СостоянияОС.ОсновноеСредство) КАК РегСостояниеОС
	|		ПО РегАмортизация.ОсновноеСредство = РегСостояниеОС.ОсновноеСредство}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.МестонахождениеОС.СрезПоследних(
	|			                &ДатаКон,
	|			                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК МестонахождениеОС
	|		ПО РегАмортизация.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство}
	|{ГДЕ
	|	РегАмортизация.ОсновноеСредство.*,
	|	РегСведенияОбОС.СпособНачисленияАмортизации            КАК СпособНачисления,
	|	РегАмортизация.СтоимостьНачальныйОстаток,
	|	РегАмортизация.СтоимостьКонечныйОстаток,
	|	РегАмортизация.СтоимостьОборот,
	|	РегАмортизация.АмортизацияНачальныйОстаток,
	|	РегАмортизация.АмортизацияКонечныйОстаток,
	|	РегАмортизация.АмортизацияОборот,
	|	СУММА(РегАмортизация.СтоимостьКонечныйОстаток) 
	|		- СУММА(РегАмортизация.АмортизацияКонечныйОстаток) КАК ОстаточнаяСтоимость,
	|	РегСведенияОбОС.ПервоначальнаяСтоимость,
	|	РегСостояниеОС.ДатаВводаВЭксплуатацию,
	|	РегСостояниеОС.ДатаСнятияСУчета,
	|	МестонахождениеОС.МОЛ,
	|	МестонахождениеОС.Местонахождение}
	|
	|// Снятые с учета внутри периода не выводим
	|	ГДЕ ((РегСостояниеОС.ДатаСнятияСУчета Есть NULL) ИЛИ (РегСостояниеОС.ДатаСнятияСУчета >= &ДатаНач))
	|
	|СГРУППИРОВАТЬ ПО
	|	РегАмортизация.ОсновноеСредство,
	|	РегСведенияОбОС.СпособНачисленияАмортизации,
	|	РегАмортизация.ОсновноеСредство.Представление,
	|	РегСостояниеОС.ДатаВводаВЭксплуатацию,
	|	РегСостояниеОС.ДатаСнятияСУчета,
	|	МестонахождениеОС.МОЛ,
	|	МестонахождениеОС.Местонахождение
	|{УПОРЯДОЧИТЬ ПО
	|	ОсновноеСредство.*,
	|	ДатаВводаВЭксплуатацию,
	|	ДатаСнятияСУчета,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьКонечныйОстаток,
	|	СтоимостьОборот,
	|	АмортизацияНачальныйОстаток,
	|	АмортизацияКонечныйОстаток,
	|	АмортизацияОборот,
	|	ОстаточнаяСтоимость,
	|	СпособНачисления,
	|	ПервоначальнаяСтоимость,
	|	МОЛ,
	|	Местонахождение}
	|ИТОГИ
	|	СУММА(СтоимостьНачальныйОстаток),
	|	СУММА(СтоимостьКонечныйОстаток),
	|	СУММА(СтоимостьОборот),
	|	СУММА(АмортизацияНачальныйОстаток),
	|	СУММА(АмортизацияКонечныйОстаток),
	|	СУММА(АмортизацияОборот),
	|	СУММА(ОстаточнаяСтоимость),
	|	СУММА(ПервоначальнаяСтоимость)
	|ПО
	|	ОБЩИЕ,
	|	СпособНачисления
	|{ИТОГИ ПО
	|	ОсновноеСредство.*,
	|	СпособНачисления,
	|	МОЛ,
	|	Местонахождение}
	|АВТОУПОРЯДОЧИВАНИЕ";	
	СтруктураПредставлениеПолей = Новый Структура;
	СтруктураПредставлениеПолей.Вставить( "ОсновноеСредство",            НСтр("ru='Основное средство';uk='Основний засіб'"));
	СтруктураПредставлениеПолей.Вставить( "ДатаВводаВЭксплуатацию",      НСтр("ru='Дата ввода в эксплуатацию';uk='Дата введення в експлуатацію'"));
	СтруктураПредставлениеПолей.Вставить( "ДатаСнятияСУчета",            НСтр("ru='Дата снятия с учета';uk='Дата зняття з обліку'"));
	СтруктураПредставлениеПолей.Вставить( "СпособНачисления",            НСтр("ru='Способ начисления амортизации';uk='Спосіб нарахування амортизації'"));
	
	СтруктураПредставлениеПолей.Вставить( "Местонахождение",             НСтр("ru='Подразделение';uk='Підрозділ'"));
	
	СтруктураПредставлениеПолей.Вставить( "ПервоначальнаяСтоимость",     НСтр("ru='Первоначальная стоимость';uk='Первинна вартість'"));
	СтруктураПредставлениеПолей.Вставить( "СтоимостьНачальныйОстаток",   НСтр("ru='Стоимость на начало периода';uk='Вартість на початок періоду'"));
	СтруктураПредставлениеПолей.Вставить( "СтоимостьОборот",             НСтр("ru='Изменение стоимости';uk='Зміна вартості'"));
	СтруктураПредставлениеПолей.Вставить( "СтоимостьКонечныйОстаток",    НСтр("ru='Стоимость на конец периода';uk='Вартість на кінець періоду'"));
	СтруктураПредставлениеПолей.Вставить( "ОстаточнаяСтоимость",         НСтр("ru='Остаточная стоимость';uk='Залишкова вартість'"));
	
	СтруктураПредставлениеПолей.Вставить( "АмортизацияНачальныйОстаток", НСтр("ru='Амортизация на начало периода';uk='Амортизація на початок періоду'"));
	СтруктураПредставлениеПолей.Вставить( "АмортизацияОборот",           НСтр("ru='Амортизация за период';uk='Амортизація за період'"));
	СтруктураПредставлениеПолей.Вставить( "АмортизацияКонечныйОстаток",  НСтр("ru='Амортизация на конец периода';uk='Амортизація на кінець періоду'"));
	
	ПостроительОтчета.Текст = Текст;
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	
	ОбщийОтчет.ЗаполнитьПоказатели( "ПервоначальнаяСтоимость",   НСтр("ru='Первоначальная стоимость';uk='Первинна вартість'"),    Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьНачальныйОстаток", НСтр("ru='Стоимость на начало периода';uk='Вартість на початок періоду'"), Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьОборот",           НСтр("ru='Изменение стоимости';uk='Зміна вартості'"),         Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьКонечныйОстаток",  НСтр("ru='Стоимость на конец периода';uk='Вартість на кінець періоду'"),  Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "ОстаточнаяСтоимость",       НСтр("ru='Остаточная стоимость';uk='Залишкова вартість'"),        Истина, "ЧЦ=15; ЧДЦ=2");
	
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияНачальныйОстаток", НСтр("ru='Амортизация на начало периода';uk='Амортизація на початок періоду'"), Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияОборот",           НСтр("ru='Амортизация за период';uk='Амортизація за період'"),         Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияКонечныйОстаток",  НСтр("ru='Амортизация на конец периода';uk='Амортизація на кінець періоду'"),  Истина, "ЧЦ=15; ЧДЦ=2");
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("ОсновноеСредство");
	
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);

	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.РаскрашиватьИзмерения     = Истина;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры // Настроить()

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет  = ЭтотОбъект;
	
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет=Неопределено) Экспорт
	
	// Если отчет, вызвавший процедуру, не передан, то считаем, что ее вызвал этот отчет
	Если Отчет = Неопределено Тогда
		Отчет = ЭтотОбъект;
	КонецЕсли;

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет);
	
КонецПроцедуры

ОбщийОтчет.ИмяРегистра = "СтоимостьОС";
ОбщийОтчет.мНазваниеОтчета = НСтр("ru='Ведомость по амортизации ОС (управленческий учет)';uk='Відомість по амортизації ОЗ (управлінський облік)'");
ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
ОбщийОтчет.мРежимВводаПериода = 0;
ОбщийОтчет.мВыбиратьИспользованиеСвойств = Ложь;
#КонецЕсли
